#include <stdio.h>
#include "stm32f103x6.h"
#include "sseg.c"
#include "timer_pwm.h"
#include "adc.h"
#include "usart.h"
#include "hd44780.c"

void pwm(void);					//декларација функције и њених параметара
void ADC_Init(void);			//декларација функције и њених параметара
void timerispisa1(void);		//декларација функције и њених параметара
void UART1_Init(void);			//декларација функције и њених параметара
void btn(void);					//декларација функције и њених параметара

int main(void){

	LCD_Init();					//иницијализација LCD дисплеја
	pwm();						//иницијализација PWM сигнала
	ADC_Init();					//иницијализација АД конвертора
	timerispisa1();				//иницијализација тајмера 1, за исписивање података
	UART1_Init();				//иницијализација UART комуникације

	while(1){
		btn();					//проверавамо да ли је неки тастер/прекидач спуштен
		delay(100);				//осигуравамо да због брзине извршавања петље нека команда не буде прихваћена два пута
	}
}

