#include <stdio.h>

//функција која нам омогућава "паузу" између изрвшавања линија кода између којих се функција налази
void delay(uint32_t us) {
	uint32_t time = 100*us/7; //формирамо бројач
	while(--time);			  //петља не ради ништа док бројач не дође до нуле
}

//функција која конвертује дати број у стринг
int intToStr(int x, char *ptr) {
	char tempBuf[20] = "";  			//привремени бафер
	int i = 0;
	do {
		tempBuf[i++] = '0' + x % 10;	//формирање цифре типа стринг
		x = x / 10;						//одсецање последње цифре
	} while (x);

	for (x = 0; x < i; x++) {
		ptr[x] = tempBuf[i - x - 1];	//паковање цифара у број типа стринг
	}
	return i;							//враћамо дужину новонасталог стринга
}

//функција помоћу које текст поруке пакујемо у стринг, са два броја
uint8_t kopirajUString(char* buffer, char* str, int* pvrednost, int* pvrednost2){
	int length=0; 															//дужина стринга
	int k=0; 																//индикатор убацивања инт броја

	while ((*str)!=0){														//пролазак кроз све карактере
		if ((*str) == '/') {												//карактер / означава да након њега убацујемо у стринг следећи знак без обзира да ли је специјални карактер или не
				*buffer++ = *++str;											//убацујемо карактер у бафер
				length++;													//повећавамо дужину
			}
		if ((*str) != '%') {												//други специјални карактер је %, након њега долазе бројеви, уколико то није случај убацујемо следећи карактер у бафер и идемо даље
				*buffer++ = *str++;											//убацујемо карактер у бафер
				length++;													//повећавамо дужину
			}
		else{
			str++;															//прелазимо на следећи карактер (прескачемо специјални карактер)
			if (*str == 'd' && k==0){										//d нам означава да је реч о инт броју, уколико је к једнако 0 значи да се ради о првом броју који убацујемо
				int ivred = *((int*)pvrednost);								//убацујемо вредност са адресе на коју показивач показује
				int koeff = 10000;											//максималан број цифара броја изражен кроз коефицијент
				int prvaCifra = 1;											//иницијализадица подразумевне прве цифре
				while(koeff>=1){
					int cifra = ivred/koeff;								//извлачење цифре
					if (prvaCifra == 1 && cifra == 0 && koeff != 1)	{		//уколико број има мање цифара од почетне претпоставке
						koeff = koeff/10;									//смањујемо кеофицијент за цифру
						continue;											//враћамо се на почетак while петље
					}
					else
						prvaCifra = 0;										//иначе сматрамо да је 0

					ivred -= cifra*koeff;									//умањујемо наш број за извучену цифру
					*buffer++ = '0'+cifra;									//додајемо карактер цифре у бафер
					length++;												//повећавамо дужину стринга
					koeff = koeff/10;										//смањујемо коефицијент
				}
				k++;														//мењамо индикатор, пребацујемо на други број
			}
			else if (*str == 'd' && k==1){									//исто као у претходном делу само за други број
				int ivred = *((int*)pvrednost2);
				int koeff = 10000;
				int prvaCifra = 1;
				while(koeff>=1){
					int cifra = ivred/koeff;
					if (prvaCifra == 1 && cifra == 0 && koeff != 1)	{
						koeff = koeff/10;
						continue;
						}
					else
						prvaCifra = 0;

					ivred -= cifra*koeff;
					*buffer++ = '0'+cifra;
					length++;
					koeff = koeff/10;
					}
			}
			str++;															//идемо на следећи караткер
		}
	}

	return length;															//враћамо дужину
}


